[
  {
    "image": "https://static.vecteezy.com/system/resources/previews/018/930/698/non_2x/facebook-logo-facebook-icon-transparent-free-png.png",
    "title": "Facebook: Connect People",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Facebook helps you stay connected with friends, family, and communities around the world. Share photos, videos, and life updates in seconds. Join groups that match your interests and discover trending topics every day. Follow your favorite pages to stay updated on news and entertainment. React and comment to express your thoughts instantly. Use Facebook Marketplace to buy and sell locally. Watch live videos or stream your own events easily. Stay in touch through Messenger and group chats. Control your privacy and choose who sees your posts. Facebook keeps your social world in one place — simple, fun, and interactive.",
    "size": 50,
    "reviews": "18K",
    "ratingAvg": 4.2,
    "downloads": "7.5M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 400000 }
    ]
  },
  {
    "image": "https://img.freepik.com/free-psd/instagram-application-logo_23-2151544100.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "Instagram: Share Life",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Instagram is your space to share photos, videos, and everyday moments with the world. Create beautiful posts using creative filters and editing tools. Share your stories that disappear after 24 hours. Connect with your favorite creators and discover new trends daily. Explore content that inspires you across fashion, travel, food, and lifestyle. Chat privately with friends through direct messages. Use Reels to express yourself with short, fun, and creative clips. Build your personal brand or grow your business through insights and reach. Stay updated with what’s happening in your community. Instagram makes sharing your life easy, visual, and full of creativity.",
    "size": 40,
    "reviews": "17K",
    "ratingAvg": 4.5,
    "downloads": "9.8M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 160000 }
    ]
  },
  {
    "image": "https://pngimg.com/d/whatsapp_PNG95159.png",
    "title": "WhatsApp: Chat Securely",
    "companyName": "WhatsApp LLC",
    "id": 3,
    "description": "WhatsApp is a simple, secure, and reliable way to stay in touch with anyone. Send text messages, voice notes, photos, and videos instantly. Make crystal-clear voice and video calls with just one tap. Create group chats to stay connected with family and friends. Enjoy end-to-end encryption that keeps your messages private and secure. Use WhatsApp Web to chat from your computer. Share your live location in real time and express yourself with stickers and emojis. Broadcast important updates to multiple contacts at once. WhatsApp keeps your communication fast, private, and totally free.",
    "size": 30,
    "reviews": "19K",
    "ratingAvg": 4.6,
    "downloads": "8.2M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 80000 }
    ]
  },
  {
    "image": "https://pngimg.com/d/youtube_PNG5.png",
    "title": "YouTube: Watch Videos",
    "companyName": "Google LLC",
    "id": 4,
    "description": "YouTube lets you watch, share, and discover millions of videos from around the world. Follow your favorite creators and subscribe to channels you love. Learn anything — from tutorials and news to entertainment and gaming. Create and upload your own videos easily from your phone. Watch live streams and premieres in real time. Enjoy personalized recommendations tailored to your interests. Save videos to watch offline when you’re on the go. Join the conversation through comments and community posts. Use YouTube Shorts to make quick and engaging videos. YouTube is the home of endless creativity and entertainment for everyone.",
    "size": 60,
    "reviews": "16K",
    "ratingAvg": 4.3,
    "downloads": "9.3M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 240000 }
    ]
  },
  {
    "image": "https://img.freepik.com/free-psd/social-media-logo-design_23-2151296966.jpg",
    "title": "TikTok: Short Clips",
    "companyName": "TikTok Pte. Ltd.",
    "id": 5,
    "description": "TikTok is the leading platform for creating and discovering short videos. Capture your creativity in 15-second clips or longer stories. Explore millions of videos personalized for you. Use trending sounds, music, and effects to make your content stand out. Follow creators who inspire you and connect with your audience. Join viral challenges and become part of global trends. Edit videos with professional filters and transitions right from your phone. Express yourself freely and have fun with friends. TikTok makes creativity simple, fast, and truly addictive.",
    "size": 70,
    "reviews": "20K",
    "ratingAvg": 4.7,
    "downloads": "8.9M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 40000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/018/930/695/non_2x/twitter-logo-twitter-icon-transparent-free-free-png.png",
    "title": "Twitter: Global Trends",
    "companyName": "Twitter, Inc.",
    "id": 6,
    "description": "Twitter helps you see what’s happening in the world right now. Follow breaking news, trending topics, and live events instantly. Share your thoughts with the world in short tweets. Follow people who inspire, entertain, and inform you. Join conversations using hashtags and threads. Stay informed about global updates and local communities. Express yourself through photos, GIFs, and videos. Get real-time feedback from your followers. Twitter is your open window to everything that’s trending — fast, fresh, and interactive.",
    "size": 50,
    "reviews": "18K",
    "ratingAvg": 4.0,
    "downloads": "7.1M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 80000 }
    ]
  },
  {
    "image": "https://pngimg.com/d/snapchat_PNG71.png",
    "title": "Snapchat: Fun Moments",
    "companyName": "Snap Inc",
    "id": 7,
    "description": "Snapchat is the fun way to share moments with friends. Capture quick photos and videos called Snaps. Send messages that disappear after viewing. Explore stories from friends, creators, and the world. Use lenses, filters, and AR effects to transform your selfies. Stay connected through chats and Bitmojis. Discover breaking news and shows in the Discover section. Create group stories with friends at events. Share your live location with trusted contacts. Snapchat brings creativity, privacy, and fun together in one app.",
    "size": 40,
    "reviews": "15K",
    "ratingAvg": 4.4,
    "downloads": "6.8M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 40000 }
    ]
  },
  {
    "image": "https://m.media-amazon.com/images/I/51rttY7a+9L._h1_.png",
    "title": "Spotify: Music Stream",
    "companyName": "Spotify Ltd.",
    "id": 8,
    "description": "Spotify is your go-to music streaming platform for every mood. Discover millions of songs and podcasts from artists worldwide. Create your own playlists or listen to curated mixes. Explore personalized recommendations that match your taste. Enjoy offline playback and ad-free experience with Premium. Follow your favorite artists to get their latest releases. Share music with friends through links and stories. Listen on any device — mobile, tablet, or desktop. Spotify keeps your world full of sound, rhythm, and inspiration.",
    "size": 80,
    "reviews": "19K",
    "ratingAvg": 4.5,
    "downloads": "9.5M",
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 16000 },
      { "name": "4 star", "count": 24000 },
      { "name": "5 star", "count": 32000 }
    ]
  },
  {
    "image": "https://pngimg.com/uploads/netflix/netflix_PNG13.png",
    "title": "Netflix: Movie Shows",
    "companyName": "Netflix, Inc.",
    "id": 9,
    "description": "Netflix lets you watch movies, TV shows, and documentaries anytime, anywhere. Enjoy exclusive Netflix Originals from around the world. Stream in high quality on any device. Download episodes and watch offline when you travel. Discover new content with personalized recommendations. Create multiple profiles for your family members. Continue watching where you left off. Rate titles to improve your recommendations. Netflix is your home for unlimited entertainment, always ad-free and always on.",
    "size": 90,
    "reviews": "17K",
    "ratingAvg": 4.6,
    "downloads": "8.3M",
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 16000 }
    ]
  },
  {
    "image": "https://m.media-amazon.com/images/I/31epF-8N9LL.png",
    "title": "Amazon: Online Deals",
    "companyName": "Amazon Mobile LLC",
    "id": 10,
    "description": "Amazon brings the world’s largest online marketplace to your fingertips. Shop millions of products across every category. Get fast and reliable delivery on your orders. Track shipments in real time. Enjoy secure payment options and easy returns. Explore deals, discounts, and daily offers. Manage your wishlist and shopping cart effortlessly. Discover global brands and local sellers in one place. Amazon makes shopping simple, safe, and satisfying every time.",
    "size": 100,
    "reviews": "20K",
    "ratingAvg": 4.3,
    "downloads": "9.1M",
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 18000 },
      { "name": "5 star", "count": 24000 }
    ]
  },
  {
    "image": "https://www.google.com/images/branding/product/2x/maps_96in128dp.png",
    "title": "G. Maps: Easy Navigation",
    "companyName": "Google LLC",
    "id": 11,
    "description": "Google Maps helps you explore the world with ease. Get real-time GPS navigation and live traffic updates. Discover nearby restaurants, shops, and landmarks. Save your favorite places for quick access. Use voice-guided directions while driving or walking. View satellite imagery and street-level views. Plan trips and explore new routes confidently. Find parking, gas stations, and public transit info easily. Google Maps makes every journey smarter, faster, and stress-free.",
    "size": 110,
    "reviews": "15K",
    "ratingAvg": 4.7,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 8000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/QRRGW2tMZ4-FNw0XWk6WWiXHaQCGxuwM-92HrBhlA4WOd_AGmjVmQkiHyAqQjW2yByc",
    "title": "G. Chrome: Fast Browsing",
    "companyName": "Google LLC",
    "id": 12,
    "description": "Google Chrome offers fast, secure, and simple web browsing. Browse multiple tabs with smooth performance. Sync bookmarks, passwords, and history across devices. Use voice search for quick results. Enjoy built-in security against malware and phishing. Browse privately with Incognito mode. Customize your browser with extensions and themes. Translate web pages instantly into your language. Google Chrome keeps the web fast, safe, and beautifully simple.",
    "size": 120,
    "reviews": "19K",
    "ratingAvg": 4.4,
    "downloads": "9.7M",
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 16000 }
    ]
  },
  {
    "image": "https://sm.pcmag.com/pcmag_uk/review/g/google-dri/google-drive_knva.png",
    "title": "Google Drive: File Storage",
    "companyName": "Google LLC",
    "id": 13,
    "description": "Google Drive lets you securely store and access your files from anywhere. Upload photos, documents, and videos easily. Collaborate in real time with colleagues and friends. Share files with custom permissions for privacy control. Access files offline when needed. Use powerful search to find files quickly. Integrate seamlessly with Google Docs, Sheets, and Slides. Organize folders to keep everything tidy. Google Drive ensures your data is safe, organized, and always accessible.",
    "size": 100,
    "reviews": "16K",
    "ratingAvg": 4.4,
    "downloads": "8.7M",
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 18000 },
      { "name": "5 star", "count": 24000 }
    ]
  }
]
